Bachelor Thesis/3D.00/q4.879/system/funkySetBoundaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inlet 
{
    field alpha1;
    expressions
    (
	{
	        target 		value;
        	patchName 	inlet;
                expression 	"pos().z < 1.224 ? 1 : 0";
	}
    );
}

inlet
{
    field U;
    expressions
    (
	{
		target 		value;
		patchName	inlet;
		expression	"alpha1 == 1 ? vector(0.7226,0,0) : vector(0,0,0)";
	}
    );
} 

// ************************************************************************* //
